Revit 2027 API
BuiltInFailures.RevisionCloudFailures.ProhibitModificationOfIssuedRevisionCloud Property
 Issued Revision Clouds can't be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProhibitModificationOfIssuedRevisionCloud { get; }
Public Shared ReadOnly Property ProhibitModificationOfIssuedRevisionCloud As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProhibitModificationOfIssuedRevisionCloud {
	FailureDefinitionId^ get ();
}
static member ProhibitModificationOfIssuedRevisionCloud : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevisionCloudFailures Class
Autodesk.Revit.DB Namespace